In [1]:
import numpy as np
import pandas as pd

# 生成对象
Pandas 默认自动生成整数索引

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.000288 -1.670798 -0.583823  0.001086
2013-01-02  1.590597  0.134473  1.967268  1.004006
2013-01-03 -0.856835  0.468363 -0.590455  1.336486
2013-01-04 -1.156413  0.133688 -0.662350  0.460846
2013-01-05 -2.189075  0.410024  1.395725 -1.426904
2013-01-06  0.004660 -0.590272 -1.147764  1.565871

In [5]:
# 用 Series 字典对象生成 DataFrame:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 查看数据

In [7]:
df.head()

                   A         B         C         D
2013-01-01  1.000288 -1.670798 -0.583823  0.001086
2013-01-02  1.590597  0.134473  1.967268  1.004006
2013-01-03 -0.856835  0.468363 -0.590455  1.336486
2013-01-04 -1.156413  0.133688 -0.662350  0.460846
2013-01-05 -2.189075  0.410024  1.395725 -1.426904

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.156413  0.133688 -0.662350  0.460846
2013-01-05 -2.189075  0.410024  1.395725 -1.426904
2013-01-06  0.004660 -0.590272 -1.147764  1.565871

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.267796 -0.185754  0.063100  0.490232
std    1.411653  0.819317  1.283734  1.100241
min   -2.189075 -1.670798 -1.147764 -1.426904
25%   -1.081519 -0.409282 -0.644376  0.116026
50%   -0.426088  0.134081 -0.587139  0.732426
75%    0.751381  0.341136  0.900838  1.253366
max    1.590597  0.468363  1.967268  1.565871

In [13]:
df.T # 转置

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.000288    1.590597   -0.856835   -1.156413   -2.189075    0.004660
B   -1.670798    0.134473    0.468363    0.133688    0.410024   -0.590272
C   -0.583823    1.967268   -0.590455   -0.662350    1.395725   -1.147764
D    0.001086    1.004006    1.336486    0.460846   -1.426904    1.565871

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.001086 -0.583823 -1.670798  1.000288
2013-01-02  1.004006  1.967268  0.134473  1.590597
2013-01-03  1.336486 -0.590455  0.468363 -0.856835
2013-01-04  0.460846 -0.662350  0.133688 -1.156413
2013-01-05 -1.426904  1.395725  0.410024 -2.189075
2013-01-06  1.565871 -1.147764 -0.590272  0.004660

In [18]:
df.sort_values(by='C') # 对排序

                   A         B         C         D
2013-01-06  0.004660 -0.590272 -1.147764  1.565871
2013-01-04 -1.156413  0.133688 -0.662350  0.460846
2013-01-03 -0.856835  0.468363 -0.590455  1.336486
2013-01-01  1.000288 -1.670798 -0.583823  0.001086
2013-01-05 -2.189075  0.410024  1.395725 -1.426904
2013-01-02  1.590597  0.134473  1.967268  1.004006

In [30]:
df['A']

2013-01-01    1.000288
2013-01-02    1.590597
2013-01-03   -0.856835
2013-01-04   -1.156413
2013-01-05   -2.189075
2013-01-06    0.004660
Freq: D, Name: A, dtype: float64

用 [ ] 切片行：

In [32]:
df[0:3]

                   A         B         C         D
2013-01-01  1.000288 -1.670798 -0.583823  0.001086
2013-01-02  1.590597  0.134473  1.967268  1.004006
2013-01-03 -0.856835  0.468363 -0.590455  1.336486

In [31]:
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01  1.000288 -1.670798 -0.583823  0.001086
2013-01-02  1.590597  0.134473  1.967268  1.004006
2013-01-03 -0.856835  0.468363 -0.590455  1.336486

In [33]:
df.loc[dates[0]]

A    1.000288
B   -1.670798
C   -0.583823
D    0.001086
Name: 2013-01-01 00:00:00, dtype: float64

In [34]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  1.000288 -1.670798
2013-01-02  1.590597  0.134473
2013-01-03 -0.856835  0.468363
2013-01-04 -1.156413  0.133688
2013-01-05 -2.189075  0.410024
2013-01-06  0.004660 -0.590272

In [35]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.590597  0.134473
2013-01-03 -0.856835  0.468363
2013-01-04 -1.156413  0.133688

In [38]:
df.loc[:,'A']

2013-01-01    1.000288
2013-01-02    1.590597
2013-01-03   -0.856835
2013-01-04   -1.156413
2013-01-05   -2.189075
2013-01-06    0.004660
Freq: D, Name: A, dtype: float64

# 按位置选择

In [39]:
df.iloc[3]

A   -1.156413
B    0.133688
C   -0.662350
D    0.460846
Name: 2013-01-04 00:00:00, dtype: float64

In [40]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.156413  0.133688
2013-01-05 -2.189075  0.410024

In [41]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.590597  1.967268
2013-01-03 -0.856835 -0.590455
2013-01-05 -2.189075  1.395725

# 布尔索引

In [42]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.000288 -1.670798 -0.583823  0.001086
2013-01-02  1.590597  0.134473  1.967268  1.004006
2013-01-06  0.004660 -0.590272 -1.147764  1.565871

In [43]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.000288       NaN       NaN  0.001086
2013-01-02  1.590597  0.134473  1.967268  1.004006
2013-01-03       NaN  0.468363       NaN  1.336486
2013-01-04       NaN  0.133688       NaN  0.460846
2013-01-05       NaN  0.410024  1.395725       NaN
2013-01-06  0.004660       NaN       NaN  1.565871

In [44]:
df2 = df.copy()

In [45]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [46]:
df2

                   A         B         C         D      E
2013-01-01  1.000288 -1.670798 -0.583823  0.001086    one
2013-01-02  1.590597  0.134473  1.967268  1.004006    one
2013-01-03 -0.856835  0.468363 -0.590455  1.336486    two
2013-01-04 -1.156413  0.133688 -0.662350  0.460846  three
2013-01-05 -2.189075  0.410024  1.395725 -1.426904   four
2013-01-06  0.004660 -0.590272 -1.147764  1.565871  three

In [47]:
 df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.856835  0.468363 -0.590455  1.336486   two
2013-01-05 -2.189075  0.410024  1.395725 -1.426904  four

# 赋值

In [50]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20191226', periods=6))
s1

2019-12-26    1
2019-12-27    2
2019-12-28    3
2019-12-29    4
2019-12-30    5
2019-12-31    6
Freq: D, dtype: int64

In [57]:
df.at[dates[0], 'A'] = 0

In [58]:
df.iat[0, 1] = 0

In [60]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [66]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.583823  5
2013-01-02  1.590597  0.134473  1.967268  5
2013-01-03 -0.856835  0.468363 -0.590455  5
2013-01-04 -1.156413  0.133688 -0.662350  5
2013-01-05 -2.189075  0.410024  1.395725  5
2013-01-06  0.004660 -0.590272 -1.147764  5

用 where 条件赋值：

In [67]:
df2 = df.copy()

In [68]:
df2[df2 > 0] = -df2

In [69]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.583823 -5
2013-01-02 -1.590597 -0.134473 -1.967268 -5
2013-01-03 -0.856835 -0.468363 -0.590455 -5
2013-01-04 -1.156413 -0.133688 -0.662350 -5
2013-01-05 -2.189075 -0.410024 -1.395725 -5
2013-01-06 -0.004660 -0.590272 -1.147764 -5

# 缺失值

重建索引（reindex）可以更改、添加、删除指定轴的索引，并返回数据副本，即不更改原数据

In [72]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.583823  5  1.0
2013-01-02  1.590597  0.134473  1.967268  5  1.0
2013-01-03 -0.856835  0.468363 -0.590455  5  NaN
2013-01-04 -1.156413  0.133688 -0.662350  5  NaN

# 运算